# TRABALHO PRÁTICO 2

In [1]:
#NÃO ALTERE AS LINHAS ABAIXO
import sys
#!{sys.executable} -m pip install sqlite3
!{sys.executable} -m pip install pandas
#!{sys.executable} -m pip install csv
!{sys.executable} -m pip install gdown

Requirement already satisfied: pandas in /home/lean/anaconda3/lib/python3.11/site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/lean/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/lean/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/lean/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /home/lean/anaconda3/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /home/lean/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: gdown in /home/lean/anaconda3/lib/python3.11/site-packages (4.7.1)
Requirement already satisfied: filelock in /home/lean/anaconda3/lib/python3.11/site-packages (from gdown) (3.9.0)
Requirement already satisfied: requests[socks] in /home/lean/anaconda3/lib/python3.11/site-packages (from gdown) (2.31.0)
Requirement already satisfied: six in /home/lean/anaconda3/lib/python3.11/site-packages (from gdown) (1.16.0)
Requirement already satisfied: tqdm in /home/lean/anaconda3/lib/python3.11/site-packages (from gdown) (4.65.0)
Requirement already satisfied: beautifulsoup4 in /home/lean/anaconda3/lib/python3.11/site-packages (from gdown) (4.12.2)
Requirement already satisfied: soupsieve>1.2 in /home/lean/anaconda3/lib/python3.11/site-packages (from beautifulsoup4->gdown) (2.4)
Requirement already satisfied: charset-normalizer<4,>=2 in /home/lean/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in /home/lean/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /home/lean/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /home/lean/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (2023.7.22)
Requirement already satisfied: PySocks!=1.5.7,>=1.5.6 in /home/lean/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (1.7.1)

In [2]:
#NÃO ALTERE AS LINHAS ABAIXO
import sqlite3 as sql3
import pandas as pd
import csv
import gdown

## Banco de Dados

In [3]:
#NÃO ALTERE AS LINHAS ABAIXO
!gdown "https://drive.google.com/file/d/1tD55Ud9yW0mT_kDDDO49Gcv7vKHY99BA"

/home/lean/anaconda3/lib/python3.11/site-packages/gdown/parse_url.py:44: UserWarning: You specified a Google Drive link that is not the correct link to download a file. You might want to try `--fuzzy` option or the following url: https://drive.google.com/uc?id=None
  warnings.warn(
Downloading...
From: https://drive.google.com/file/d/1tD55Ud9yW0mT_kDDDO49Gcv7vKHY99BA
To: /home/lean/Documentos/TP`s IBD/TP2-IBD/TP2-IBD/1tD55Ud9yW0mT_kDDDO49Gcv7vKHY99BA
84.4kB [00:00, 317MB/s]

In [4]:
#NÃO ALTERE AS LINHAS ABAIXO
con = sql3.connect(":memory:")
sql_file = open('databaseTP2sqlite.sql', encoding="utf8")
cur = con.cursor()
db = sql_file.read()
cur.executescript(db)
con.commit()

## Estrutura das Tabelas do Banco de Dados

### TABELA REGIOES

In [5]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('regioes')"
df = pd.read_sql(query, con)
display(df)

   cid         name     type  notnull dflt_value  pk
0    0    regiao_id  INTEGER        0       None   1
1    1  nome_regiao     TEXT        0       None   0

### TABELA ABRANGENCIA SAUDE

In [6]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('abrangencia_saude')"
df = pd.read_sql(query, con)
display(df)

    cid                       name     type  notnull dflt_value  pk
0     0  id_area_abrangencia_saude  INTEGER        0       None   1
1     1                   cod_smsa  INTEGER        0       None   0
2     2      nome_area_abrangencia     TEXT        0       None   0
3     3                nome_regiao     TEXT        0       None   0
4     4          nome_centro_saude     TEXT        0       None   0
5     5         tipo_logradouro_cs     TEXT        0       None   0
6     6         nome_logradouro_cs     TEXT        0       None   0
7     7           numero_imovel_cs  INTEGER        0       None   0
8     8        nome_bairro_popular     TEXT        0       None   0
9     9      telefone_centro_saude     TEXT        0       None   0
10   10    data_ultima_atualizacao     TEXT        0       None   0
11   11                  geometria     TEXT        0       None   0
12   12          bairro_popular_id  INTEGER        0       None   0
13   13                  regiao_id  INTEGER        0       None   0

### TABELA REDE MUNICIPAL ESCOLAS

In [7]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('rede_municipal_escolas')"
df = pd.read_sql(query, con)
display(df)

    cid                 name     type  notnull dflt_value  pk
0     0    id_equip_educacao  INTEGER        0       None   1
1     1                 nome     TEXT        0       None   0
2     2      dependencia_adm     TEXT        0       None   0
3     3          codigo_inep  INTEGER        0       None   0
4     4      tipo_logradouro     TEXT        0       None   0
5     5           logradouro     TEXT        0       None   0
6     6               numero  INTEGER        0       None   0
7     7          complemento     REAL        0       None   0
8     8  nome_bairro_popular     TEXT        0       None   0
9     9          nome_regiao     TEXT        0       None   0
10   10            geometria     TEXT        0       None   0
11   11    bairro_popular_id  INTEGER        0       None   0
12   12            regiao_id  INTEGER        0       None   0

### TABELA BAIRROS

In [8]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('bairros')"
df = pd.read_sql(query, con)
display(df)

   cid                 name     type  notnull dflt_value  pk
0    0    bairro_popular_id  INTEGER        0       None   1
1    1  nome_bairro_popular     TEXT        0       None   0

### TABELA FAMILIAS CRAS

In [9]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('familias_cras')"
df = pd.read_sql(query, con)
display(df)

   cid                name     type  notnull dflt_value  pk
0    0         nome_regiao     TEXT        0       None   0
1    1                cras     TEXT        0       None   0
2    2       qtde_familias  INTEGER        0       None   0
3    3  mes_ano_referencia     TEXT        0       None   0
4    4           regiao_id  INTEGER        0       None   0

## Arquivo de Resultados

In [10]:
#NÃO ALTERE AS LINHAS ABAIXO
tp1_csv = "TP2.csv"
queries = open(tp1_csv, 'w')
writer = csv.writer(queries, delimiter=';')
writer.writerow(["Query Number", "Row Count", "Query"])

30

## Função de Consulta
A função abaixo executa a consulta, exibe o retorno da consulta no banco e grava os dados necessários no arquivo resultado.

In [11]:
#NÃO ALTERE AS LINHAS ABAIXO
def runQuery(query, query_name):
  df = pd.read_sql(query, con)
  query_size = df.shape[0]
  writer.writerow([query_name, query_size, query])
  display(df)

## CONSULTAS SQL

### QUANTIDADE DE FAMILIAS INSCRITAS NO CRAS POR REGIÃO DE BH

In [12]:
a1 = "SELECT regioes.nome_regiao, SUM(familias_cras.qtde_familias) AS familias_regiao FROM regioes JOIN familias_cras ON regioes.regiao_id = familias_cras.regiao_id GROUP BY regioes.nome_regiao ORDER BY familias_regiao ASC;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a1, "a1")

            nome_regiao  familias_regiao
0  Endereco FORA Region                6
1              PAMPULHA            23328
2            CENTRO-SUL            24355
3              NOROESTE            28236
4                 LESTE            28713
5                 OESTE            29193
6              NORDESTE            34773
7            VENDA NOVA            35514
8              BARREIRO            39171
9                 NORTE            42245

### QUANTIDADE DE CENTROS DE SAÚDE POR REGIÃO DE BH

In [13]:
a2 = "SELECT regioes.nome_regiao, COUNT(abrangencia_saude.id_area_abrangencia_saude) AS centros_regiao FROM regioes JOIN abrangencia_saude ON regioes.nome_regiao = abrangencia_saude.nome_regiao GROUP BY regioes.nome_regiao ORDER BY centros_regiao;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a2, "a2")

  nome_regiao  centros_regiao
0  CENTRO-SUL              12
1       LESTE              14
2    PAMPULHA              14
3    NOROESTE              16
4  VENDA NOVA              17
5       OESTE              18
6    BARREIRO              20
7       NORTE              20
8    NORDESTE              21

### QUANTIDADE DE ESCOLAS POR REGIÃO DE BH

In [14]:
a3 = "SELECT regioes.nome_regiao, COUNT(rede_municipal_escolas.id_equip_educacao) AS escolas_regiao FROM regioes JOIN rede_municipal_escolas ON regioes.nome_regiao = rede_municipal_escolas.nome_regiao GROUP BY regioes.nome_regiao ORDER BY escolas_regiao ASC;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a3, "a3")

  nome_regiao  escolas_regiao
0  CENTRO-SUL              50
1    PAMPULHA              52
2       LESTE              56
3       OESTE              56
4    NOROESTE              60
5  VENDA NOVA              64
6       NORTE              67
7    NORDESTE              75
8    BARREIRO              77

### QUANTIDADE DE CENTROS ESPORTIVOS POR REGIÃO DE BH

In [15]:
a4 = "SELECT  regioes.nome_regiao, abrangencia_saude.nome_bairro_popular, COUNT(abrangencia_saude.id_area_abrangencia_saude) AS total_bairro FROM abrangencia_saude JOIN regioes ON abrangencia_saude.nome_regiao = regioes.nome_regiao GROUP BY abrangencia_saude.nome_bairro_popular ORDER BY total_bairro DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a4, "a4")

  nome_regiao      nome_bairro_popular  total_bairro
0       NORTE                Jaqueline             3
1  CENTRO-SUL            Santo Antônio             2
2  VENDA NOVA             Santa Mônica             2
3    NORDESTE         Ribeiro de Abreu             2
4    PAMPULHA               Ouro Preto             2
5  VENDA NOVA              Mantiqueira             2
6       OESTE          Madre Gertrudes             2
7    BARREIRO                  Lindéia             2
8  VENDA NOVA  Jardim dos Comerciarios             2
9       NORTE        Jardim Felicidade             2

### TOP 10 BAIRROS COM MAIS CENTROS DE SAÚDE DE BH

In [16]:
a5 = "SELECT  regioes.nome_regiao, abrangencia_saude.nome_bairro_popular, COUNT(abrangencia_saude.id_area_abrangencia_saude) AS total_bairro FROM abrangencia_saude JOIN regioes ON abrangencia_saude.nome_regiao = regioes.nome_regiao GROUP BY abrangencia_saude.nome_bairro_popular ORDER BY total_bairro DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a4, "a4")

  nome_regiao      nome_bairro_popular  total_bairro
0       NORTE                Jaqueline             3
1  CENTRO-SUL            Santo Antônio             2
2  VENDA NOVA             Santa Mônica             2
3    NORDESTE         Ribeiro de Abreu             2
4    PAMPULHA               Ouro Preto             2
5  VENDA NOVA              Mantiqueira             2
6       OESTE          Madre Gertrudes             2
7    BARREIRO                  Lindéia             2
8  VENDA NOVA  Jardim dos Comerciarios             2
9       NORTE        Jardim Felicidade             2

### TOP 10 BAIRROS COM MAIS ESCOLAS DE BH

In [17]:
a6 = "SELECT regioes.nome_regiao, rede_municipal_escolas.nome_bairro_popular, COUNT(rede_municipal_escolas.nome_bairro_popular) AS total_bairro FROM rede_municipal_escolas JOIN regioes ON regioes.nome_regiao = rede_municipal_escolas.nome_regiao GROUP BY nome_bairro_popular ORDER BY total_bairro DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a5, "a5")

  nome_regiao      nome_bairro_popular  total_bairro
0       NORTE                Jaqueline             3
1  CENTRO-SUL            Santo Antônio             2
2  VENDA NOVA             Santa Mônica             2
3    NORDESTE         Ribeiro de Abreu             2
4    PAMPULHA               Ouro Preto             2
5  VENDA NOVA              Mantiqueira             2
6       OESTE          Madre Gertrudes             2
7    BARREIRO                  Lindéia             2
8  VENDA NOVA  Jardim dos Comerciarios             2
9       NORTE        Jardim Felicidade             2

# Finalizando o Banco de Dados e o Arquivo de Consultas gerado:

In [18]:
#NÃO ALTERE AS LINHAS ABAIXO
queries.close()
con.close()

## Compactando Arquivos
Na célula abaixo, substitua onde está escrito MATRÍCULA pelo seu número de matrícula.

In [19]:
!zip -r "TP2.zip" "TP2.ipynb" "TP2.csv"

updating: TP2.ipynb (deflated 89%)
updating: TP2.csv (deflated 80%)

**LEMBRE-SE:** Após finalizar todas as consultas, clique em *Kernel -> Restart and Run All* no ambiente em que estiver usando (Jupyter ou Google Colab)

Caso esteja usando o Google Colab, colocar manualmente o arquivo .ipynb no zip